```
MCGA License V1.0
Copyright (c) 2024 著作权由MCGA组织所有，著作权人保留一切权利。
允许所有人复制和转发本授权文件的完整版本，但不允许对它进行任何修改。
https://github.com/MCGA1976/.github/blob/main/licenses/MCGA%20License.md
```

注意：所有 MCGA License 都由简体中文书写，并由MCGA组织发布，其他语言的译本不是使用 MCGA License 授权的发布条款 —— 只有 MCGA License 的简体中文原版具有这样的效力。

<br />

**以下是复制，发布和修改软件的详细条款和条件**

### 0. 定义

- “许可证”是指本文件第1节至第9节所定义的使用、复制和分发的条款和条件。
- “许可方”是指版权所有者或者版权所有者授予本许可证的实体。
- “法人实体”是指行为实体以及控制该实体、受该实体控制或与该实体共同控制的所有其它实体的联合体。在本定义中，“控制”是指
  - (i) 直接或间接领导或管理该实体的权力，无论是通过合同还是其它方式
  - (ii) 拥有百分之五十 (50%) 或更多已发行股份
  - (iii) 拥有该实体的实益所有权
- “您/你”（或“您/你的”）是指行使本许可证授予权限的个人或法人实体。
- “源”的形式是指进行修改的首选形式，包括但不限于软件源代码、源文件和配置文件。
- “对象”的形式是指源的形式经机器转换或翻译后产生的任何形式，包括但不限于编译后的目标代码、生成的文件以及到其它媒体类型的转换。
- “作品”是指根据本许可证提供的原创作品（无论是源还是对象的形式），如作品中包含或附加的版权声明所示（下面的附录中提供了示例）。
- “衍生作品”是指基于（或源自）某一作品的任何作品（无论是源还是对象的形式），并且在整体上代表一个独立创作的编辑修订、注释、拓展或其它修改的作品。就本许可证而言，衍生作品不包括仅仅与原始作品或其衍生作品之间的接口有链接关系（或通过名称绑定）的作品。
- “贡献”是指任何原创作品（包括作品的原始版本以及对该作品或其衍生作品进行任何修改或添加后的版本）被版权所有者或者授权代表版权所有者进行提交的个人或者法律实体有意向地提交给许可方，以便将其纳入到作品中。就本定义而言，“提交”是指以任何形式的电子、口头或书面沟通的形式发送给许可方或者其代表，包括但不限于由许可方或者代表许可方管理的电子邮件列表、源代码控制系统和问题跟踪系统上的沟通，用于讨论和改进工作，但不包括版权所有者明显标记或者以其它书面方式指定为“非贡献”的沟通。
- “贡献者”是指许可方和代表贡献被许可方接受并随后纳入作品的任何个人或法人实体。
- “商业行为”是指以营利为目的的经营性行为。

<br />

### 1.有条件地允许商业行为

按照本许可证的条款和条件，您需要在获取MCGA组织许可后可以以任何形式使用本作品、其衍生作品、包含本作品（部分或全部）的作品用于商业行为。包括但不限于制造以售卖、委托制造以售卖、许诺销售、销售、进口本作品、其衍生作品、包含本作品（部分或全部）的作品。（可能会收取费用）

<br />

### 2.禁止专利使用

按照本许可证的条款和条件，MCGA组织保留专利（除非在本节中另有约定），禁止所有非MCGA组织的公司、群体、个人以任何形式申请此作品、其衍生作品、包含本作品（部分或全部）的作品的专利。

<br />

### 3.有条件地允许再分发

您可以在任何媒体上以源或对象的形式复制和分发本作品的副本（无论经过修改还是未经修改）。但需满足以下条件：

(a)您必须向作品或其衍生作品的任何其他接收者提供本许可证的原版副本；

(b)您必须在再分发时明确标注MCGA的组织名和附有原项目的链接；

(c)您必须让任何经过修改的文件带有显著的声明，说明您更改了文件；

(d)在您分发的任何衍生作品的源中，您必须保留该作品的源中的所有版权、专利、商标和归属的声明，但不包括与衍生作品任何部分无关的声明；

(e)如果作品包括一个“声明”文本文件作为其分发的一部分，则您分发的任何衍生作品都必须在以下至少一个地方包括该声明文件中包含的归属声明的可读副本，但不包括与衍生作品任何部分无关的声明：作为衍生作品的一部分分发的声明文本文件内；如果存在与衍生作品一起提供的源或文档，则在源或文档中；或者，在衍生作品生成的显示中第三方声明通常出现的任何地方。声明文件的内容仅供参考，不会修改许可证。您可以在您分发的衍生作品中添加您自己的归属声明，与作品中的声明文本一起或作为其附录，前提是此类附加归属声明不会被视为对许可证的修改。

您可以在您修改后的作品中添加您自己的版权声明，并可以为您修改后的作品或整个衍生作品的使用、复制或分发提供附加或不同的许可条款和条件，前提是您对作品的使用、复制和分发在其它方面符合本许可证中约定的条件。

<br />

### 4.有条件地允许修改

您可以任何修改本作品的副本（无论经过修改还是未经修改）。但需满足以下条件：

(a)您必须向作品或其衍生作品的任何其他接收者提供本许可证的原版副本；

(b)您修改后的衍生作品的副本必须保持开源（除非获得MCGA组织许可后您修改后的衍生作品可以保持闭源）；

(c)您必须在再分发时明确标注MCGA的组织名和附有原项目的链接；

(d)您必须让任何经过修改的文件带有显著的声明，说明您更改了文件；

(e)在您分发的任何衍生作品的源中，您必须保留该作品的源中的所有版权、专利、商标和归属的声明，但不包括与衍生作品任何部分无关的声明；

(f)如果作品包括一个“声明”文本文件作为其分发的一部分，则您分发的任何衍生作品都必须在以下至少一个地方包括该声明文件中包含的归属声明的可读副本，但不包括与衍生作品任何部分无关的声明：作为衍生作品的一部分分发的声明文本文件内；如果存在与衍生作品一起提供的源或文档，则在源或文档中；或者，在衍生作品生成的显示中第三方声明通常出现的任何地方。声明文件的内容仅供参考，不会修改许可证。您可以在您分发的衍生作品中添加您自己的归属声明，与作品中的声明文本一起或作为其附录，前提是此类附加归属声明不会被视为对许可证的修改。

您可以在您修改后的作品中添加您自己的版权声明，并可以为您修改后的作品或整个衍生作品的使用、复制或分发提供附加或不同的许可条款和条件，前提是您对作品的使用、复制和分发在其它方面符合本许可证中约定的条件。

<br />

### 5.提交贡献

除非您另有明确说明，否则您向许可方有意提交的包含在作品中的任何贡献均将遵守本许可证的条款和条件，无任何附加条款或条件。尽管有上述约定，本文中的任何内容均不得取代或修改您可能与许可方就前述贡献签署的任何单独许可协议的条款。

<br />

### 6.版权

本许可证不授予使用许可方的商号、商标、服务标记或产品名称的权限，除非在合理和习惯使用范围内，用于描述作品的起源和复制声明文件的内容。

<br />

### 7.免责声明

除非适用法律要求或书面同意，本许可证应用于任何条件，许可方“按原样”提供作品（并且每个贡献者提供其贡献），不带有任何明示或暗示的担保或条件，包括但不限于任何对作品的所有权、不侵权、可销售性或适合特定用途的保证或条件。您全权负责确定使用或重新分发本作品的适当性，并承担与您按照本许可证行使权限相关的任何风险。

<br />

### 8.责任限制

在任何情况下，根据任何法律理论，无论是侵权行为（包括过失侵权）、合同还是其它原因，除非适用法律的要求（例如故意）或书面同意，否则任何贡献者均不对您的损害承担责任，包括因本许可证或因使用或无法使用本作品而产生的任何直接、间接、特殊、附带或间接性质的损害（包括但不限于商誉损失、停工造成的损害、计算机故障，或其它任何商业损害或损失），即使贡献者事先已被告知发生前述损害的可能性。

**以上为全部条款和条件**